<a href="https://colab.research.google.com/github/Abd-Fattah/Database-Management-and-Practice--IBT3205-/blob/main/Lab%232.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [9]:
import pandas as pd
import numpy as np
import matplotlib as plt
import seaborn as sns
import sklearn as skl
import sqlite3

In [10]:
conn = sqlite3.connect('database.sqlite')

In [ ]:
conn.execute('''
CREATE TABLE IF NOT EXISTS Company
(ID INT PRIMARY KEY NOT NULL,
NAME TEXT NOT NULL,
AGE INT NOT NULL,
ADDRESS CHAR(50),
SALARY REAL);
''')

In [15]:
conn.execute("INSERT INTO Company (ID, NAME, AGE, ADDRESS, SALARY) VALUES (1, 'Paul', 32, 'California', 20000.00)");
conn.execute("INSERT INTO Company (ID, NAME, AGE, ADDRESS, SALARY) VALUES (2, 'Allen', 25, 'Texas', 15000.00)");
conn.execute("INSERT INTO Company (ID, NAME, AGE, ADDRESS, SALARY) VALUES (3, 'Teddy', 23, 'Norway', 20000.00)");
conn.execute("INSERT INTO Company (ID, NAME, AGE, ADDRESS, SALARY) VALUES (4, 'Mark', 25, 'Rich-Mond', 65000.00)");

In [16]:
conn.commit()

In [ ]:
cursor = conn.execute("SELECT ID, NAME, AGE, ADDRESS, SALARY FROM Company")

for row in cursor:
  print("ID = ", row[0])
  print("NAME = ", row[1])
  print("AGE = ", row[2])
  print("ADDRESS = ", row[3])
  print("SALARY = ", row[4], "\n")

conn.close()

In [ ]:
conn = sqlite3.connect('database.sqlite')

cursor = conn.execute("SELECT name FROM sqlite_master WHERE type='table';")

tables = [table[0] for table in cursor.fetchall()]

print(tables)

In [ ]:
cursor = conn.execute("SELECT ID, NAME, AGE, ADDRESS, SALARY FROM Company")

for row in cursor:
  print("ID = ", row[0])
  print("NAME = ", row[1])
  print("AGE = ", row[2])
  print("ADDRESS = ", row[3])
  print("SALARY = ", row[4], "\n")

In [ ]:
# Function to connect to database and create table
def create_database_and_table():
    conn = sqlite3.connect('company_database_ver2.db')
    conn.execute('''
    CREATE TABLE IF NOT EXISTS Company
    (ID INT PRIMARY KEY NOT NULL,
    NAME TEXT NOT NULL,
    AGE INT NOT NULL,
    ADDRESS CHAR(50),
    SALARY REAL);''')
    conn.close()

# Function to insert initial and additional rows
def insert_rows():
    conn = sqlite3.connect('company_database_ver2.db')
    for i in range(1, 25):
        conn.execute(f"INSERT INTO Company (ID, NAME, AGE, ADDRESS, SALARY) VALUES ({i}, 'Person{i}', {20 + i}, 'Location{i}', {10000 + i*100});")
    conn.commit()
    conn.close()

# Function to list tables
def list_tables():
    conn = sqlite3.connect('company_database_ver2.db')
    cursor = conn.execute("SELECT name FROM sqlite_master WHERE type='table';")
    tables = [table[0] for table in cursor.fetchall()]
    print("List of tables in the database:", tables)
    conn.close()

# Function to show all rows from Company Table
def list_rows():
    conn = sqlite3.connect('company_database_ver2.db')
    cursor = conn.execute("SELECT ID, NAME, AGE, ADDRESS, SALARY from Company")
    print("Show all rows from Company Table:")
    for row in cursor:
      print("ID = ", row[0])
      print("NAME = ", row[1])
      print("AGE = ", row[2])
      print("ADDRESS = ", row[3])
      print("SALARY = ", row[4], "\n")


# Create database and table
create_database_and_table()

# Insert initial and additional rows
insert_rows()

# List tables in the database
list_tables()

#show all rows from Company Table
list_rows()

In [32]:
conn.close()